In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import itertools

%matplotlib inline

In [5]:
# # Converting txt files to .csv
# df_t = pd.read_fwf('df_final_web_data_pt_1.txt')
# df_t.to_csv('df_final_web_data_pt_1.csv')

In [6]:
df_1 = 'df_final_demo.csv'
df_2= 'df_final_experiment_clients.csv'
df_3 = 'df_final_web_data_merged.csv'

#df_t1 = 'df_final_web_data_pt_1.csv'

df_fd = pd.read_csv(df_1)
df_fe_c = pd.read_csv(df_2)
df_fw_dm = pd.read_csv(df_3)
#df_p1 = pd.read_csv(df_t1)

C:\Users\dylan\AppData\Local\Temp\ipykernel_6804\688577527.py:9: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  df_fw_dm = pd.read_csv(df_3)

In [7]:
#df_p1

In [8]:
df_fw_dm

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
755401,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
755402,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
755403,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
755404,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
755405,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [9]:
df_fe_c

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

The marked client ID's are the one that were in the test, the others were not in the test

In [10]:
df_fd

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [11]:
DF_D =  df_fw_dm[df_fw_dm.duplicated()]

In [12]:
DF_ND =  df_fw_dm[~df_fw_dm.duplicated()]

In [13]:
DF_ND.iloc[364]

client_id                            9358626
visitor_id             148475529_63668223960
visit_id        223297395_36250329195_832161
process_step                           start
date_time                2017-04-28 12:27:28
Name: 364, dtype: object

In [14]:
DF_D

,client_id,visitor_id,visit_id,process_step,date_time
365,9358626,148475529_63668223960,223297395_36250329195_832161,start,2017-04-28 12:27:28
368,5376894,622509328_44408201172,688984457_43441834354_912755,start,2017-04-28 14:20:01
383,438567,923318467_50708963627,330543236_29863358529_771432,start,2017-04-28 02:52:29
785,1423857,716830992_81930238382,568819166_80596727019_75889,confirm,2017-04-10 22:44:58
1816,372523,730241475_25771921122,25331354_74479847014_854987,start,2017-04-27 10:51:26
...,...,...,...,...,...
755262,1672289,658797407_91003097342,430110748_90347503221_597628,start,2017-05-01 19:28:53
755305,4408245,14058946_73585431797,994148957_84373994761_991865,start,2017-06-06 09:17:23
755307,4408245,14058946_73585431797,994148957_84373994761_991865,start,2017-06-06 09:09:44
755309,4408245,14058946_73585431797,994148957_84373994761_991865,start,2017-06-06 08:51:16
755359,3897324,80177429_24869309091,149796456_64325617570_112561,start,2017-05-04 08:21:30

In [15]:
df_fw_dm.isnull().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [16]:
df_fw_dm = df_fw_dm[~df_fw_dm.duplicated()]

In [17]:
df_fw_dm

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
755401,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
755402,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
755403,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
755404,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
755405,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [18]:
# use this to change the scientific notation
pd.set_option('display.float_format', '{:.2f}'.format)
df_fd.describe().T

,count,mean,std,min,25%,50%,75%,max
client_id,70609.00,5004991.88,2877277.63,169.00,2519329.00,5016978.00,7483085.00,9999839.00
clnt_tenure_yr,70595.00,12.05,6.87,2.00,6.00,11.00,16.00,62.00
clnt_tenure_mnth,70595.00,150.66,82.09,33.00,82.00,136.00,192.00,749.00
clnt_age,70594.00,46.44,15.59,13.50,32.50,47.00,59.00,96.00
num_accts,70595.00,2.26,0.53,1.00,2.00,2.00,2.00,8.00
bal,70595.00,147445.24,301508.71,13789.42,37346.83,63332.90,137544.90,16320040.15
calls_6_mnth,70595.00,3.38,2.24,0.00,1.00,3.00,6.00,7.00
logons_6_mnth,70595.00,5.57,2.35,1.00,4.00,5.00,7.00,9.00

In [19]:
df_sub = df_fd[df_fd['bal'].isnull()]

In [20]:
df_sub

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
4164,7402828,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8316,355337,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8677,8412164,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13444,2222915,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18066,4876926,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25961,5277910,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28432,7616759,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35323,8191345,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43518,1227228,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
46076,8611797,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47189,5144725,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49846,1037867,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
63701,1618749,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66219,6021001,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
df_fd.dropna(inplace = True)

In [22]:
df_fd.isnull().sum()

client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
dtype: int64

In [23]:
df_fd = df_fd.astype({'clnt_tenure_yr': int,'clnt_tenure_mnth': int,'clnt_age': int,'calls_6_mnth': int,'logons_6_mnth': int,'num_accts': int })

In [24]:
df_fd

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6,73,60,U,2,45105.30,6,9
1,2304905,7,94,58,U,2,110860.30,6,9
2,1439522,5,64,32,U,2,52467.79,6,9
3,1562045,16,198,49,M,2,67454.65,3,6
4,5126305,12,145,33,F,2,103671.75,0,3
...,...,...,...,...,...,...,...,...,...
70604,7993686,4,56,38,U,3,1411062.68,5,5
70605,8981690,12,148,31,M,2,101867.07,6,6
70606,333913,16,198,61,F,2,40745.00,3,3
70607,1573142,21,255,68,M,3,475114.69,4,4
70608,5602139,21,254,59,F,3,157498.73,7,7

In [25]:
df_fe_c.isnull().sum()

client_id        0
Variation    20109
dtype: int64

In [26]:
df_fe_c.describe(include = 'all')

        client_id Variation
count    70609.00     50500
unique        NaN         2
top           NaN      Test
freq          NaN     26968
mean   5004991.88       NaN
std    2877277.63       NaN
min        169.00       NaN
25%    2519329.00       NaN
50%    5016978.00       NaN
75%    7483085.00       NaN
max    9999839.00       NaN